In [1]:
import numpy as np
import pandas as pd
import random
import datetime

In [2]:
dfKota = pd.DataFrame(data=[[1, 'Jakarta'],
                           [2, 'Tangerang'],
                           [3, 'Bandung'],
                           [4, 'Semarang'],
                           [5, 'Denpasar'],
                           [6, 'Surabaya']], columns=['id','nama'])
dfKota

   id       nama
0   1    Jakarta
1   2  Tangerang
2   3    Bandung
3   4   Semarang
4   5   Denpasar
5   6   Surabaya

In [ ]:
def GenerateKota():

In [4]:
namaToko = []
kotaToko = []
alamatToko = []
idToko = []
totalIncome = []
dateTime = []

for i in range(1,101):
    namaToko.append('Toko '+str(i))
for i in range(1,101):
    alamatToko.append('Alamat '+str(i))
for i in range(1,101):
    idToko.append(str(i))
####################################################################################################
for i in range(1,101):
    kotaToko.append(random.randint(1,6))
####################################################################################################
for i in range(1,101):
    totalIncome.append(random.randint(1000,10000))
for i in range(1,101):
    dateTime.append(datetime.datetime(random.randint(2015,2019), random.randint(1,12), random.randint(1,27)))
dfToko = pd.DataFrame({'id':idToko,
                       'namaToko':namaToko,
                       'kotaId': kotaToko,
                       'alamat':alamatToko,
                       'totalIncome': totalIncome,
                       'tanggalBerdiri' : dateTime})
dfToko.head()

  id namaToko  kotaId    alamat  totalIncome tanggalBerdiri
0  1   Toko 1       4  Alamat 1         2229     2015-12-05
1  2   Toko 2       4  Alamat 2         8383     2019-12-15
2  3   Toko 3       1  Alamat 3         7235     2015-09-17
3  4   Toko 4       3  Alamat 4         1425     2019-12-01
4  5   Toko 5       1  Alamat 5         4976     2015-05-11

In [ ]:
dfToko['kotaId'].value_counts()

In [ ]:
dfKota['id'][0]